In [1]:
import pandas as pd

In [2]:
score = pd.read_csv('score - 시트2.csv', encoding = 'utf-8')
score

    과목  1반  2반  3반  4반
0  파이썬  45  44  73  39
1   DB  76  92  45  69
2   자바  47  92  45  69
3  크롤링  92  81  85  40
4  Web  11  79  47  26

In [3]:
score = pd.read_csv('score - 시트2.csv', index_col = '과목', encoding = 'utf-8')
score

     1반  2반  3반  4반
과목
파이썬  45  44  73  39
DB   76  92  45  69
자바   47  92  45  69
크롤링  92  81  85  40
Web  11  79  47  26

In [4]:
score.sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [5]:
score.sum().sort_values(ascending = False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [51]:
score.sum().sort_values(descending)

NameError: name 'descending' is not defined

In [6]:
score.sum(axis = 1)

과목
파이썬    201
DB     282
자바     253
크롤링    298
Web    163
dtype: int64

In [7]:
score['합계'] = score.sum(axis = 1)
score
# why???

     1반  2반  3반  4반   합계
과목
파이썬  45  44  73  39  201
DB   76  92  45  69  282
자바   47  92  45  69  253
크롤링  92  81  85  40  298
Web  11  79  47  26  163

In [8]:
score['평균'] = score.loc[:,:'4반'].mean(axis = 1)
score
# 행의 범위는 전체, 열의 범위는 4반 까지만 -> loc[:,:'4반']

     1반  2반  3반  4반   합계     평균
과목
파이썬  45  44  73  39  201  50.25
DB   76  92  45  69  282  70.50
자바   47  92  45  69  253  63.25
크롤링  92  81  85  40  298  74.50
Web  11  79  47  26  163  40.75

In [9]:
score.max()
# 반 별로 최댓값

1반     92.0
2반     92.0
3반     85.0
4반     69.0
합계    298.0
평균     74.5
dtype: float64

In [10]:
score.min()

1반     11.00
2반     44.00
3반     45.00
4반     26.00
합계    163.00
평균     40.75
dtype: float64

In [11]:
score.loc[:,:'4반'].max(axis = 1)

과목
파이썬    73
DB     92
자바     92
크롤링    92
Web    79
dtype: int64

In [12]:
maxArr = score.loc[:'Web',:'4반'].max(axis = 1)
maxArr

과목
파이썬    73
DB     92
자바     92
크롤링    92
Web    79
dtype: int64

In [13]:
minArr = score.loc[:'Web',:'4반'].min(axis = 1)
minArr

과목
파이썬    39
DB     45
자바     45
크롤링    40
Web    11
dtype: int64

In [14]:
subtract = maxArr - minArr
subtract

과목
파이썬    34
DB     47
자바     47
크롤링    52
Web    68
dtype: int64

In [15]:
data_dic = {'A':[1,3,3,4,4], 'B':[1,2,2,3,3,],'C':[1,2,4,4,5]}
df3 = pd.DataFrame(data_dic)
df3

   A  B  C
0  1  1  1
1  3  2  2
2  3  2  4
3  4  3  4
4  4  3  5

In [16]:
df4 = df3.apply(pd.value_counts)
df4
# 각 값이 몇 개씩 있었는지 세어 준다.

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [17]:
df4.fillna(0)
# 결측치를 모두 0으로 바꿔준다.

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [18]:
data_dic1 = {'나이':['1~15', '16~25', '26~35', '36~60', '61~99'], '구분':['미성년자','청년','중년','장년','노년']}
df5 = pd.DataFrame(data_dic1)
df5

      나이    구분
0   1~15  미성년자
1  16~25    청년
2  26~35    중년
3  36~60    장년
4  61~99    노년

In [19]:
ages = [0,2,10,21,23,37,61,31,41,32,100]
bins = [0,15,25,35,60,99]
# 맨 왼쪽은 초과로 설정되어 있다. 
# bins: 구간(범위)
# 0은 분류에 포함되지 않는다.
labels = ['미성년자','청년','중년','장년','노년']
# bins에서 설정한 구간에 이름(라벨링)을 붙힌다.
cats = pd.cut(ages, bins, labels = labels)

In [20]:
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '노년', '중년', '장년', '중년', NaN]
Length: 11
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [21]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [22]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [23]:
ageArr = pd.DataFrame(ages, columns  = ['ages'])
ageArr

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     61
7     31
8     41
9     32
10   100

In [24]:
ageArr['age_cats'] = cats
ageArr

    ages age_cats
0      0      NaN
1      2     미성년자
2     10     미성년자
3     21       청년
4     23       청년
5     37       장년
6     61       노년
7     31       중년
8     41       장년
9     32       중년
10   100      NaN

In [29]:
ageArr['age_cats'].value_counts()

미성년자    2
청년      2
중년      2
장년      2
노년      1
Name: age_cats, dtype: int64

In [32]:
# {}(=딕셔너리)를 판다스에 있는 데이타 프레임으로 바꿔 줄거야.. 
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                   index = [0,1,2,3])
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D6','D6','D7']},
                   index = [4,5,6,7])
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']},
                   index = [8,9,10,11])

In [34]:
result = pd.concat([df1, df2, df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D6
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### *axis = 1: 행(index)을 기준으로 동작
### *axis = 0: 열(columns)을 기준으로 동작

In [35]:
result1 = pd.concat([df1,df2,df3], keys = ['x','y','z'])
# keys 속성 부여 시 다중 인덱스가 된다. 
result1

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D6
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [36]:
result1.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [43]:
result1.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [44]:
df4 = pd.DataFrame({'B':['B2','B3','B6','B7'],
                   'D':['D2','D3','D6','D7'],
                   'F':['F2','F3','F6','F7']},
                   index = [2,3,6,7])
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [45]:
result2= pd.concat([df1,df4], axis = 1)
# axis = 1 을 써서 행 기준으로 정렬, 행은 같은 값이 겹쳐서 출력, 열은 겹치지않고 출력
result2

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [46]:
result3 = pd.concat([df1,df4], axis = 1, join = 'inner')
# join = 'inner'가 뭐라고...??
result3

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [49]:
result4 = pd.concat([df1,df4],ignore_index = True)
# ignore_index = True -> 행을 무시하니까 열을 기준으로 정렬? Nope.
# 행 겹치는 거 무시하고 그냥 내가 임의로 넣을게
# ignore_index = True -> 기존 인덱스를 무시하고 새로운 인덱스를 부여하는 기능!!
result4

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7